# Создайте пустой список empty_lst.
# Нужно вывести на экран логическое значение, которое показывает, что список пустой.
# - подсказка: посчитать длину списка сравнить его с 0 и присвоить его логической переменно is_empty.
# Распечатайте is_empty и убедитесь, что вывелось True
empty_lst = []
print(len(empty_lst))
is_empty = len(empty_lst) > 0
print(is_empty)
