# С помощью инструкции (оператора) = присвоить переменной my_sum значения 10.
my_sum = 10

# Создать переменную my_bool и присвоить ей значение True
# С помощью инструкции if проверить my_bool. Если оно истинно, ты вывести на экран строку Ok
my_bool = True
if my_bool == True:
    print('Ok')


# С помощью инструкции def создать функцию  hello без параметров, которая выводит наэкран строку Hello!
# Затем ее вызвать.
def hello():
    print("Hello!")


hello()
