# Создайте список user_lst имен john, sam and nick.
# Создать цикл по списку user_lst, где user_name будет название переменной, что создается в цикле.
# Распечатать user_name в теле цикла.
# Убедиться, что будут распечатаны john, sam and nick каждый с новой строки.
user_lst = ["john", "sam", "nick"]
for user_name in user_lst:
    print(user_name)
