# Создать переменную is_admin и присвоить ей значение истина.
# Распечатать is_admin и убедиться, что вывелось True
is_admin = True
print(is_admin)

# Создать переменную is_longer и присвоить ей значение 100 > 20.
# Распечатать is_longer и убедиться, что вывелось True
is_longer = 100 > 20
print(is_longer)

# Создать переменную is_shorter и присвоить ей значение 200 > 300.
# Распечатать is_shorter и убедиться, что вывелось False
is_shorter = 200 > 300
print(is_shorter)

# Сравним две строки
# Создать переменную is_exceeded и присвоить ей значение Hello World > Hello
# Распечатать is_exceeded и убедиться, что вывелось True
is_exceeded = "Hello World" > "Hello"
print(is_exceeded)

# C помощью функции bool преобразовать строку Hello в логическое значения и присвоить его переменной bool_value
# Распечатать bool_value и убедиться, что вывелось True
bool_value = bool("Hello")
print(bool_value)

# Преобразовать 100 в логическое значение и вывести на печать.
# Убедиться, что вывелось True
print(bool(100))

# Преобразовать 0 в логическое значение и вывести на печать.
# Убедиться, что вывелось False

print(bool(0))


