# Создать переменную user_count и присвоить ей строковое значение 100.
# Распечатать user_count и убедиться, что вывелось 100
user_count = "100"
print(user_count)

# Создать переменную str_value, которая будет содержать строку и присвоить ей значение "50"
# Преобразовать str_value в целое число и присвоить это число переменной int_value.
# Распечатать str_value и убедиться, что вывелось 50
str_value = "50"
int_value = int(str_value)
print(str_value)


# Создать переменную long_value присвоить ей значение 1500000. Для записи использовать знак подчеркивания.

long_value = 1_500_000
