# Объявить (создать) переменную user_name и присвоить ей строковое значение admin
user_name = "admin"

# Создать переменную some_data и присвоить ей целое значение 100
# Затем ей присвоить логическое значение ложь
# Затем ей присвоить строковое значение Hello!
some_data = 100
some_data = False
some_data = "Hello"

# Объявить (создать) переменную loin и присвоить ей строковое значение test.
# Обратиться к переменной по имени loin и присвоить ее значение другой переменной test_login.
# Распечатать значение переменной test.
# Распечатать значение переменной test_login.

login = "test"
test_login = login

print(login)
print(test_login)
