# Даны список машин german_cars.
# С помощью среза (т.е. :) скопировать все элементы списка german_cars в новый список с именем all_cars
# Распечатать all_cars и убедиться, что вывелось ['Audi', 'BMW', 'Opel', 'Mercedes'].
german_cars = ['Audi', 'BMW', 'Opel', 'Mercedes']
all_cars = german_cars[:]
print(all_cars)

# Даны список телефонов phone_lst и пустой список my_phone_lst.
# С помощью метода списка append скопировать все элементы из списка phone_lst в список my_phone_lst.
# Распечатать my_phone_lst и убедиться, что вывелось ['IPhone', 'Samsung'].
phone_lst = ['IPhone', 'Samsung']
my_phone_lst = []
my_phone_lst.append(phone_lst)
print(my_phone_lst)

