# Дано натуральное число. Выведите его последнюю цифру.
#
# Входные данные
# Вводится натуральное число.

# Выходные данные
# Выведите ответ на задачу.

# Примеры
# входные данные
# 179
# выходные данные
# 9

num = input("Enter the natural num: ")
print(num[-1])
