# Дано натуральное число. Выведите его последнюю цифру.
#
# Входные данные
# Вводится натуральное число.
num = input("Enter the natural num: ")
for i in num:
    int_num = int(i)
    print()



# Выходные данные
# Выведите ответ на задачу.

# Примеры
# входные данные
# 179
# выходные данные
# 9

