# Дано двузначное число. Найдите число десятков в нем.
#
# Входные данные
# Вводится двухзначное число.
#
# Выходные данные
# Выведите ответ на задачу.
#
# Примеры
# входные данные
# 42
# выходные данные
# 4

# Пишем код здесь ...
str_num = input("Enter the num: ")

print(str_num[-2])
