# Дан словарь car. Вывести на экран все ключи и для каждого ключа его значение:
# brand - Ford
# model - Mustang
# year - 1964
car = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}

for i in car:
  print(i)


