# Создать словарь student с ключами name, phone, born, height
# Вывести на экран словарь student:
print("= START =")


# Создать словарь student (изначально без ключей) и создать ключи со значениями (использовать []):
# name - "John"
# phone - "111-22-33"
# born - "20-06-2008"
# height - 186
# Вывести на экран словарь student:
print("= START =")
student = {}