# Создать словарь student с ключами name, phone, born, height
# Вывести на экран словарь student:
student = {
    "name": "Vadim",
    "phone": "375293957039",
    "born": "2008",
    "height": "187"
}
print(student)
# Создать словарь student (изначально без ключей) и создать ключи со значениями (использовать []):
# name - "John"
# phone - "111-22-33"
# born - "20-06-2008"
# height - 186
# Вывести на экран словарь student:
student = {}
student["name"] = "John"
student["phone"] = "111-22-33"
student["born"] = "20-06-2008"
student["height"] = "186"
print(student)