# 1. Попросить пользователя ввести номер телефона на экран
# 2. Вывести текст: Ваш номер: и потом то, что ввел пользователь

num1 = int(input("Enter your phone number: "))
print("Yuor phone number:", num1)
