# Вывести на экран датурождения в формате: 20/06/2008
# - использовать ыункцио print c 3 параментрами день, месяц и год
# - использовать форматированa

a = str("20/06/2008")
print(a)
