# Напишите команду, которая выведет на экран сообщение «My first task!».
print("My first task")