# Дан сет s. Распечатать все значения используя for
print("= START =")
s = {1, 2, 3}


