# Вот тут можно посмотреть теорию: https://youtu.be/vMD6-jzgDvI?t=431

# - Вывести на экран числа от 11 до 20. Использовать while
# - завести переменную и в ней хранить текущее значение (сначала та будет 11)
# - В в while проверять значение переменной. Если меньше 21, тогда печатать и значение переменнй на 1 увеличить, иначе веходим из цикла
# Код ниже

# - Вывести на экран числа от 21 до 30 с шагом 3 (21, 24, 27, 30).
# - подсказака: задача похода на предыдущую, но нeжно переменную увеличить на 3
# Код ниже