# 1. Сложить все цифры в номере своего телефона и сохранить результат в переменную res
# 2. Вывести res на экран

# код после этого комментария....
number = 3957039
a = 0
a = a + 3
a = a + 9
a = a + 5
a = a + 7
a = a + 3
a = a + 9
res = a
print(res)

# NOTE: number наверное переменная не нужна???

# С торона равна 6.
# - Посчитать площадь и положить ее в переменную square
# - Вывести res на экран

# код после этого комментария....

# первый способ
c = 6
square = c * c

print(square)

# vduzh: Я тут зря про res написал: давай ее уберем и square только оставим

#второй способ
c = 6
res = square = c**2
print(res)

# vduzh: Я тут зря про res написал: давай ее уберем и square только оставим

# Купил 1 литр кваса и поровну разделили на 5 человек. Сколько литров кваса досталось Вадим?
volume = 1
people = 5
portion = volume / people
print("Вадим получил:",portion, "литра кваса")
# код после этого комментария....


