# Установить  модуль emoji
# Подключить модуль emoji
# Из модуля emoji вызвать emojize с параметром 'Python is :thumbs_up:'. Результат сохранить в переменную s
# Вывести s на экран
print("=== Start ===")

