# Напишите программу, которая выведет на экран ываш номер телефона, а потом ваш возраст и в конце вопросительный знак.

phone_number = 3957039
age = 14

print("Your phone number: ",phone_number, "and", 
      "your age:", age, "?")