# 2 Задачи:
# 1. Вывести Python Works! в одну строку на экране
# 2. Вывести First line в первой строке, а Second line во второй строке

print("Python works")
print("First line\nSecond line")


