# Вывести на экран датурождения в формате: 20/06/2008
# - использовать ыункцио print c 3 параментрами день, месяц и год
# - использовать форматированa

a = str("20/06/2008")
print(a)


# vduzh: результат правильный, но реализация не подходит - надо переделать.
# У тебя есть 3 числа: 20, 06 и 2008. Их ты передаешь как параметры в функцию print и выводишь в виде: 20/06/2008
# Вот запусти видео и там есть Форматы вывода. Посмотри, как тебе вывести 20/06/2008
# https://youtu.be/ML5tP8m6SHw?t=190

