# Создать сет (множество) s через {} со значениями 1, 2 ,3 и распечатать.
print("= START =")
s = {1, 2, 3}
print(s)
# Создать сет (множество) s через функцию set со значениями 1, 2 ,3 и распечатать.
print("= START =")
s1 = [1, 2, 3]
s = set(s1)
print(s)
# Создать сет (множество) s через {} со значениями 1, 2 ,3, 3 и распечатать.
# Убедиться, что там будет только 3 значения (вторая тройка не добавится)
print("= START =")
s = [1, 2, 3, 3]
s1 = set(s)
print(s1)
