# 1. Создайте переменную с именем str
# 2. присвойте ей значение Hello world!
# 3. Выведите значение переменной на экран

str = "Hello world"
print(str)

# vduzh: str встроенная функция - давай переменную переименуем в s